In [1]:
print(" Hello World") # Works normal like python

 Hello World

In [2]:
import pandas as pd # just to import the file

In [3]:
# 2 main datatypes
series = pd.Series(["BMW", "Toyota", "Honda"]) #pd.Series is like putting object in a list to call them out

In [4]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [5]:
# series = 1-dimensional

In [6]:
# 2 main datatypes
colors = pd.Series(["Red", "Blue", "Yellow"]) 
colors

0       Red
1      Blue
2    Yellow
dtype: object

In [7]:
# dataframe = 2-dimensional
car_data = pd.DataFrame({"Car make": series, "Color": colors}) # calling out colors and series we listed earlier
car_data

  Car make   Color
0      BMW     Red
1   Toyota    Blue
2    Honda  Yellow

In [8]:
# Import data
car_sales = pd.read_csv("data/car-sales.csv") # pd.read_csv - this is to import the data we have in our folder note: folder location and file name must match
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [9]:
# Exporting data
car_sales.to_csv("data/exported-car-sales.csv", index=False) # this is to export the file and when we call index= false it removed some data we dont want

In [10]:
exported_car_sales = pd.read_csv("data/exported-car-sales.csv") # this is to import the file
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [11]:
# car_sales.mean(numeric_only=True) will work not  car_sales.mean()

## Describe data

In [13]:
# Attributes
car_sales.dtypes # attribute dont have () while function have it but depends on how you call them

# Function
#car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [14]:
car_sales.columns # .coloumns to list the data we have in columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [15]:
car_columns = car_sales.columns # just making it easier to call
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [16]:
car_sales.index #

RangeIndex(start=0, stop=10, step=1)

In [17]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [18]:
car_sales.describe # .describe to describe the data we have

<bound method NDFrame.describe of      Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00>

In [19]:
car_sales.info() # .info to get some specific information we need in the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [20]:
car_sales.mean(numeric_only=True) # to get the mean but you must put numeric_only = true because .mean does not work like before

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [21]:
car_prices = pd.Series([300, 1500, 111250]) # just listing the data we have in series
car_prices.mean(numeric_only=True) # getting the mean of the data above

np.float64(37683.333333333336)

In [22]:
car_sales.sum() # .sum is the total sum thats is called out

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [23]:
car_sales["Doors"].sum() # total sums of doors we have

np.int64(40)

In [24]:
len(car_sales) # len  is lenght of it but starts from 0 to 1

10

In [25]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Viewing and selecting data

In [26]:
car_sales.head(3) # gives the top part of the data

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [27]:
car_sales.tail(2) # gives the bottom part of the data

     Make Colour  Odometer (KM)  Doors      Price
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [29]:
# .loc and .iloc
animals = pd.Series(["cat", "dog", "bird", "panda", "snake"], index=[0, 3, 9, 8, 3])

In [30]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [31]:
# refrs to the index
animals.loc[9] # by number called

'bird'

In [32]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [33]:
car_sales.loc[0] # nb by index

Make                Toyota
Colour               White
Odometer (KM)       150043
Doors                    4
Price            $4,000.00
Name: 0, dtype: object

In [34]:
# .iloc refers to the postion
animals.iloc[3]

'panda'

In [35]:
car_sales.iloc[1]

Make                 Honda
Colour                 Red
Odometer (KM)        87899
Doors                    4
Price            $5,000.00
Name: 1, dtype: object

In [36]:
animals.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [37]:
car_sales.loc[:3] # same with .head

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [38]:
#regex=True eg car_sales["Price"] = car_sales["Price"].str.replace('[\$\,\.]', '', regex=True)

In [39]:
pd.crosstab(car_sales["Make"], car_sales["Doors"]) # we called out doors and make

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [40]:
# groupby
car_sales.groupby(["Make"]).mean(numeric_only=True)

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [41]:
# Import matplotlib and tell Jupyter to show plots
import matplotlib.pyplot as plt
%matplotlib inline

In [42]:
car_sales.plot(x="Make", y="Odometer (KM)");

In [43]:
car_sales["Odometer (KM)"].hist()

In [44]:
car_sales["Price"].dtype

dtype('O')

In [45]:
car_sales["Price"].plot()

TypeError: no numeric data to plot

In [46]:
car_sales["Price"] = car_sales["Price"].str.replace(r'[\$,]', '', regex=True).astype(float).astype('Int64')

In [47]:
car_sales

     Make Colour  Odometer (KM)  Doors  Price
0  Toyota  White         150043      4   4000
1   Honda    Red          87899      4   5000
2  Toyota   Blue          32549      3   7000
3     BMW  Black          11179      5  22000
4  Nissan  White         213095      4   3500
5  Toyota  Green          99213      4   4500
6   Honda   Blue          45698      4   7500
7   Honda   Blue          54738      4   7000
8  Toyota  White          60000      4   6250
9  Nissan  White          31600      4   9700

In [52]:
car_sales["Price"].plot()

## Manipulation Data

In [53]:
car_sales

     Make Colour  Odometer (KM)  Doors  Price
0  Toyota  White         150043      4   4000
1   Honda    Red          87899      4   5000
2  Toyota   Blue          32549      3   7000
3     BMW  Black          11179      5  22000
4  Nissan  White         213095      4   3500
5  Toyota  Green          99213      4   4500
6   Honda   Blue          45698      4   7500
7   Honda   Blue          54738      4   7000
8  Toyota  White          60000      4   6250
9  Nissan  White          31600      4   9700

In [54]:
car_sales["Make"] = car_sales["Make"].str.lower() # to make all strings lower in the make

In [55]:
car_sales

     Make Colour  Odometer (KM)  Doors  Price
0  toyota  White         150043      4   4000
1   honda    Red          87899      4   5000
2  toyota   Blue          32549      3   7000
3     bmw  Black          11179      5  22000
4  nissan  White         213095      4   3500
5  toyota  Green          99213      4   4500
6   honda   Blue          45698      4   7500
7   honda   Blue          54738      4   7000
8  toyota  White          60000      4   6250
9  nissan  White          31600      4   9700

In [ ]:
car_sales_missing = pd.read_csv("data/car-sales-missing-data.csv") # import the data
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [ ]:
car_sales_missing["Odometer"].mean(numeric_only=False) # getting the mean

np.float64(92302.66666666667)

In [58]:
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean(numeric_only=False))  # filling all the data in na missing value

0    150043.000000
1     87899.000000
2     92302.666667
3     11179.000000
4    213095.000000
5     92302.666667
6     92302.666667
7     92302.666667
8     60000.000000
9     31600.000000
Name: Odometer, dtype: float64

In [60]:
car_sales_missing # but not all was filled

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [61]:
# Fill the Odometer missing values to the mean with inplace=True
car_sales_missing["Odometer"] = car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean(numeric_only=False)) # created value of odometer to fill the missing value of na

In [62]:
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [63]:
car_sales

     Make Colour  Odometer (KM)  Doors  Price
0  toyota  White         150043      4   4000
1   honda    Red          87899      4   5000
2  toyota   Blue          32549      3   7000
3     bmw  Black          11179      5  22000
4  nissan  White         213095      4   3500
5  toyota  Green          99213      4   4500
6   honda   Blue          45698      4   7500
7   honda   Blue          54738      4   7000
8  toyota  White          60000      4   6250
9  nissan  White          31600      4   9700

In [64]:
car_sales_missing.dropna() # dropping or removing missing values

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

In [65]:
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [66]:
car_sales_missing.dropna(inplace=True) # by putting true change made forever

In [67]:
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

In [69]:
car_sales_missing = pd.read_csv("data/car-sales-missing-data.csv") # import the data
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [70]:
car_sales_missing_dropped = car_sales_missing.dropna() # defined new function
car_sales_missing_dropped

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500

In [71]:
car_sales_missing_dropped.to_csv("data/car-sales-missing-dropped.csv")

In [72]:
car_sales_missing_dropped

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500

In [73]:
# Column from Series
seats_column = pd.Series([5, 5, 5, 5, 5,])

# New column called seats
car_sales["Seats"] = seats_column
seats_column # adding data column to car sales

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [74]:
car_sales

     Make Colour  Odometer (KM)  Doors  Price  Seats
0  toyota  White         150043      4   4000    5.0
1   honda    Red          87899      4   5000    5.0
2  toyota   Blue          32549      3   7000    5.0
3     bmw  Black          11179      5  22000    5.0
4  nissan  White         213095      4   3500    5.0
5  toyota  Green          99213      4   4500    NaN
6   honda   Blue          45698      4   7500    NaN
7   honda   Blue          54738      4   7000    NaN
8  toyota  White          60000      4   6250    NaN
9  nissan  White          31600      4   9700    NaN

In [75]:
car_sales["Seats"].fillna(5, inplace=True) # filling all na in seats to be 5
car_sales

C:\Users\bello\AppData\Local\Temp\ipykernel_34136\2575828071.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  car_sales["Seats"].fillna(5, inplace=True) # filling all na in seats to be 5

     Make Colour  Odometer (KM)  Doors  Price  Seats
0  toyota  White         150043      4   4000    5.0
1   honda    Red          87899      4   5000    5.0
2  toyota   Blue          32549      3   7000    5.0
3     bmw  Black          11179      5  22000    5.0
4  nissan  White         213095      4   3500    5.0
5  toyota  Green          99213      4   4500    5.0
6   honda   Blue          45698      4   7500    5.0
7   honda   Blue          54738      4   7000    5.0
8  toyota  White          60000      4   6250    5.0
9  nissan  White          31600      4   9700    5.0

In [76]:
# Column from puthon list
fuel_economy = [7.5, 9.2, 5.0, 9.6, 8.7, 4,7, 7.6, 8.7, 3.0] # adding new column
car_sales["Fuel per 100KM"] = fuel_economy
car_sales

     Make Colour  Odometer (KM)  Doors  Price  Seats  Fuel per 100KM
0  toyota  White         150043      4   4000    5.0             7.5
1   honda    Red          87899      4   5000    5.0             9.2
2  toyota   Blue          32549      3   7000    5.0             5.0
3     bmw  Black          11179      5  22000    5.0             9.6
4  nissan  White         213095      4   3500    5.0             8.7
5  toyota  Green          99213      4   4500    5.0             4.0
6   honda   Blue          45698      4   7500    5.0             7.0
7   honda   Blue          54738      4   7000    5.0             7.6
8  toyota  White          60000      4   6250    5.0             8.7
9  nissan  White          31600      4   9700    5.0             3.0

In [77]:
car_sales["Total fuel used (L)"] = car_sales["Odometer (KM)"] /100 * car_sales["Fuel per 100KM"] ## to get fuel used km/100 * fuel
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used (L)
0,toyota,White,150043,4,4000,5.0,7.5,11253.225
1,honda,Red,87899,4,5000,5.0,9.2,8086.708
2,toyota,Blue,32549,3,7000,5.0,5.0,1627.450
3,bmw,Black,11179,5,22000,5.0,9.6,1073.184
4,nissan,White,213095,4,3500,5.0,8.7,18539.265
5,toyota,Green,99213,4,4500,5.0,4.0,3968.520
6,honda,Blue,45698,4,7500,5.0,7.0,3198.860
7,honda,Blue,54738,4,7000,5.0,7.6,4160.088
8,toyota,White,60000,4,6250,5.0,8.7,5220.000
9,nissan,White,31600,4,9700,5.0,3.0,948.000

In [78]:
# Create a column from a single valuw
car_sales["Number of wheels"] = 4
car_sales ## adding wheels

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used (L),Number of wheels
0,toyota,White,150043,4,4000,5.0,7.5,11253.225,4
1,honda,Red,87899,4,5000,5.0,9.2,8086.708,4
2,toyota,Blue,32549,3,7000,5.0,5.0,1627.450,4
3,bmw,Black,11179,5,22000,5.0,9.6,1073.184,4
4,nissan,White,213095,4,3500,5.0,8.7,18539.265,4
5,toyota,Green,99213,4,4500,5.0,4.0,3968.520,4
6,honda,Blue,45698,4,7500,5.0,7.0,3198.860,4
7,honda,Blue,54738,4,7000,5.0,7.6,4160.088,4
8,toyota,White,60000,4,6250,5.0,8.7,5220.000,4
9,nissan,White,31600,4,9700,5.0,3.0,948.000,4

In [79]:
car_sales["Passed road satefy"] = True
car_sales.dtypes

Make                    object
Colour                  object
Odometer (KM)            int64
Doors                    int64
Price                    Int64
Seats                  float64
Fuel per 100KM         float64
Total fuel used (L)    float64
Number of wheels         int64
Passed road satefy        bool
dtype: object

In [80]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used (L),Number of wheels,Passed road satefy
0,toyota,White,150043,4,4000,5.0,7.5,11253.225,4,True
1,honda,Red,87899,4,5000,5.0,9.2,8086.708,4,True
2,toyota,Blue,32549,3,7000,5.0,5.0,1627.450,4,True
3,bmw,Black,11179,5,22000,5.0,9.6,1073.184,4,True
4,nissan,White,213095,4,3500,5.0,8.7,18539.265,4,True
5,toyota,Green,99213,4,4500,5.0,4.0,3968.520,4,True
6,honda,Blue,45698,4,7500,5.0,7.0,3198.860,4,True
7,honda,Blue,54738,4,7000,5.0,7.6,4160.088,4,True
8,toyota,White,60000,4,6250,5.0,8.7,5220.000,4,True
9,nissan,White,31600,4,9700,5.0,3.0,948.000,4,True

In [81]:
# Drop the Price per KM column
car_sales = car_sales.drop("Total fuel used (L)", axis=1) # columns live on axis 1
car_sales # dropping the data L but most called axis=1

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Number of wheels,Passed road satefy
0,toyota,White,150043,4,4000,5.0,7.5,4,True
1,honda,Red,87899,4,5000,5.0,9.2,4,True
2,toyota,Blue,32549,3,7000,5.0,5.0,4,True
3,bmw,Black,11179,5,22000,5.0,9.6,4,True
4,nissan,White,213095,4,3500,5.0,8.7,4,True
5,toyota,Green,99213,4,4500,5.0,4.0,4,True
6,honda,Blue,45698,4,7500,5.0,7.0,4,True
7,honda,Blue,54738,4,7000,5.0,7.6,4,True
8,toyota,White,60000,4,6250,5.0,8.7,4,True
9,nissan,White,31600,4,9700,5.0,3.0,4,True

In [82]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Number of wheels,Passed road satefy
0,toyota,White,150043,4,4000,5.0,7.5,4,True
1,honda,Red,87899,4,5000,5.0,9.2,4,True
2,toyota,Blue,32549,3,7000,5.0,5.0,4,True
3,bmw,Black,11179,5,22000,5.0,9.6,4,True
4,nissan,White,213095,4,3500,5.0,8.7,4,True
5,toyota,Green,99213,4,4500,5.0,4.0,4,True
6,honda,Blue,45698,4,7500,5.0,7.0,4,True
7,honda,Blue,54738,4,7000,5.0,7.6,4,True
8,toyota,White,60000,4,6250,5.0,8.7,4,True
9,nissan,White,31600,4,9700,5.0,3.0,4,True

In [83]:
car_sales_shuffled = car_sales.sample(frac=1) # 1 is 100 get the sample but randomly

In [84]:
car_sales_shuffled

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Number of wheels,Passed road satefy
6,honda,Blue,45698,4,7500,5.0,7.0,4,True
5,toyota,Green,99213,4,4500,5.0,4.0,4,True
2,toyota,Blue,32549,3,7000,5.0,5.0,4,True
0,toyota,White,150043,4,4000,5.0,7.5,4,True
7,honda,Blue,54738,4,7000,5.0,7.6,4,True
9,nissan,White,31600,4,9700,5.0,3.0,4,True
4,nissan,White,213095,4,3500,5.0,8.7,4,True
3,bmw,Black,11179,5,22000,5.0,9.6,4,True
1,honda,Red,87899,4,5000,5.0,9.2,4,True
8,toyota,White,60000,4,6250,5.0,8.7,4,True

In [85]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Number of wheels,Passed road satefy
0,toyota,White,150043,4,4000,5.0,7.5,4,True
1,honda,Red,87899,4,5000,5.0,9.2,4,True
2,toyota,Blue,32549,3,7000,5.0,5.0,4,True
3,bmw,Black,11179,5,22000,5.0,9.6,4,True
4,nissan,White,213095,4,3500,5.0,8.7,4,True
5,toyota,Green,99213,4,4500,5.0,4.0,4,True
6,honda,Blue,45698,4,7500,5.0,7.0,4,True
7,honda,Blue,54738,4,7000,5.0,7.6,4,True
8,toyota,White,60000,4,6250,5.0,8.7,4,True
9,nissan,White,31600,4,9700,5.0,3.0,4,True

In [87]:
# only for 20 percent of the data
car_sales_shuffled.sample(frac=0.20)

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Number of wheels,Passed road satefy
1,honda,Red,87899,4,5000,5.0,9.2,4,True
6,honda,Blue,45698,4,7500,5.0,7.0,4,True

In [88]:
car_sales_shuffled.reset_index(drop=True, inplace=True) # reset the data

In [89]:
car_sales_shuffled

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Number of wheels,Passed road satefy
0,honda,Blue,45698,4,7500,5.0,7.0,4,True
1,toyota,Green,99213,4,4500,5.0,4.0,4,True
2,toyota,Blue,32549,3,7000,5.0,5.0,4,True
3,toyota,White,150043,4,4000,5.0,7.5,4,True
4,honda,Blue,54738,4,7000,5.0,7.6,4,True
5,nissan,White,31600,4,9700,5.0,3.0,4,True
6,nissan,White,213095,4,3500,5.0,8.7,4,True
7,bmw,Black,11179,5,22000,5.0,9.6,4,True
8,honda,Red,87899,4,5000,5.0,9.2,4,True
9,toyota,White,60000,4,6250,5.0,8.7,4,True

In [90]:
car_sales["Odometer (KM)"] = car_sales["Odometer (KM)"].apply(lambda x:x/1.6) # conversion from km to miles
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Number of wheels,Passed road satefy
0,toyota,White,93776.875,4,4000,5.0,7.5,4,True
1,honda,Red,54936.875,4,5000,5.0,9.2,4,True
2,toyota,Blue,20343.125,3,7000,5.0,5.0,4,True
3,bmw,Black,6986.875,5,22000,5.0,9.6,4,True
4,nissan,White,133184.375,4,3500,5.0,8.7,4,True
5,toyota,Green,62008.125,4,4500,5.0,4.0,4,True
6,honda,Blue,28561.250,4,7500,5.0,7.0,4,True
7,honda,Blue,34211.250,4,7000,5.0,7.6,4,True
8,toyota,White,37500.000,4,6250,5.0,8.7,4,True
9,nissan,White,19750.000,4,9700,5.0,3.0,4,True